<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"s3","label":"dev","backend":"f90e9ebcf59721ea5b6bc5024bb7421386e711f2b9fb5dea501982b5806856e4","plan_job_ref":"Job CICD for Splitrr Infra #28 at https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10655740791","plan_out_hash":"e8d889fdd91cc5ebf80c85fa06fa60d23ab03ad7a6f156c54c3fe2aabc25f9b9","plan_hash":"dcc300592e2ae93c2cd8587adca119e67e865aa258d985aae7dd31065124d2e4","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 5 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs-ec2.aws_appautoscaling_policy.ecs_target_cpu will be created
+   resource "aws_appautoscaling_policy" "ecs_target_cpu" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "splitrr-dev-backend-ecs-ec2-cpu-policy"
+       policy_type        = "TargetTrackingScaling"
+       resource_id        = "***********************************************************"
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       target_tracking_scaling_policy_configuration {
+           disable_scale_in   = false
+           scale_in_cooldown  = 300
+           scale_out_cooldown = 300
+           target_value       = 80

+           predefined_metric_specification {
+               predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs-ec2.aws_appautoscaling_policy.ecs_target_memory will be created
+   resource "aws_appautoscaling_policy" "ecs_target_memory" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "splitrr-dev-backend-ecs-ec2-memory-policy"
+       policy_type        = "TargetTrackingScaling"
+       resource_id        = "***********************************************************"
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"

+       target_tracking_scaling_policy_configuration {
+           disable_scale_in   = false
+           scale_in_cooldown  = 300
+           scale_out_cooldown = 300
+           target_value       = 80

+           predefined_metric_specification {
+               predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs-ec2.aws_appautoscaling_target.ecs_target will be created
+   resource "aws_appautoscaling_target" "ecs_target" {
+       arn                = (known after apply)
+       id                 = (known after apply)
+       max_capacity       = 1
+       min_capacity       = 1
+       resource_id        = "***********************************************************"
+       role_arn           = (known after apply)
+       scalable_dimension = "ecs:service:DesiredCount"
+       service_namespace  = "ecs"
+       tags_all           = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Project" = "Splitrr"
        }

+       suspended_state (known after apply)
    }

  # module.ecs-ec2.aws_autoscaling_group.app_asg will be updated in-place
!~  resource "aws_autoscaling_group" "app_asg" {
        id                               = "terraform-20240901164336886700000002"
        name                             = "terraform-20240901164336886700000002"
#        (31 unchanged attributes hidden)

-       tag {
-           key                 = "AmazonECSManaged" -> null
-           propagate_at_launch = true -> null
#            (1 unchanged attribute hidden)
        }

#        (4 unchanged blocks hidden)
    }

  # module.ecs-ec2.aws_ecs_service.app will be created
+   resource "aws_ecs_service" "app" {
+       cluster                            = "arn:aws:ecs:us-east-1:949263681218:cluster/EC2-ECS-CLUSTER"
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       force_new_deployment               = true
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = (known after apply)
+       name                               = "splitrr-dev-backend-ecs-ec2-service"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags                               = {
+           "Name" = "splitrr-dev-backend-ecs-ec2-service"
        }
+       tags_all                           = {
+           "Creator" = "bibeklabh@lftechnology.com"
+           "Name"    = "splitrr-dev-backend-ecs-ec2-service"
+           "Project" = "Splitrr"
        }
+       task_definition                    = (known after apply)
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       capacity_provider_strategy {
+           base              = 1
+           capacity_provider = "splitrr-dev-backend-ecs-ec2-capacity-provider"
+           weight            = 100
        }

+       load_balancer {
+           container_name   = "splitrr-dev-backend-ecs-ec2-container"
+           container_port   = 3001
+           target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:949263681218:targetgroup/splitrr-dev-lb-lb-tg/49769ce467dad4e9"
#            (1 unchanged attribute hidden)
        }

+       network_configuration {
+           assign_public_ip = false
+           security_groups  = [
+               "sg-0e7ba780dc6d674c1",
            ]
+           subnets          = [
+               "subnet-0976aa1e5727a1645",
+               "subnet-0d6f60a42ff1b4811",
            ]
        }

+       ordered_placement_strategy {
+           field = "attribute:ecs.availability-zone"
+           type  = "spread"
        }
    }

  # module.ecs-ec2.aws_ecs_task_definition.app must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
!~      arn                      = "arn:aws:ecs:us-east-1:949263681218:task-definition/splitrr-dev-backend-ecs-ec2-task-def:1" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:us-east-1:949263681218:task-definition/splitrr-dev-backend-ecs-ec2-task-def" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   mountPoints      = []
                    name             = "splitrr-dev-backend-ecs-ec2-container"
!~                  portMappings     = [
!~                      {
!~                          containerPort = 8080 -> 3001
!~                          hostPort      = 8080 -> 3001
-                           protocol      = "tcp"
                        },
                    ]
-                   systemControls   = []
-                   volumesFrom      = []
#                    (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      id                       = "************************************" -> (known after apply)
!~      revision                 = 1 -> (known after apply)
        tags                     = {
            "Name" = "splitrr-dev-backend-ecs-ec2-task-def"
        }
#        (12 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [CICD for Splitrr Infra #28](https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10655740791)